<?php
//Дано прямоугольное поле размерами MxN. 
//Каждая клетка поля — или свободное пространство (_), или стена (X).
//Перемещаться через стены или выходить за границы поля нельзя.

$map = [
  ['_', '_', '_', '_', '_'], // 0
  ['X', 'X', 'X', 'X', '_'], // 1
  ['_', '_', 'X', '_', '_'], // 2 line
  ['X', 'X', 'X', '_', 'X'], // 3
  ['_', '_', '_', '_', '_'], // 4
];

$map = [
  ['1', 'X', '_', '_', '_'], // 0
  ['_', 'X', '_', 'X', '_'], // 1
  ['_', 'X', '_', 'X', '_'], // 2 line
  ['_', 'X', '_', 'X', '_'], // 3
  ['_', '_', '_', 'X', '1'], // 4
];

//Задача: написать функцию, которая проверяет,
//существует ли путь от клетки с координатами (x1, y1) до выхода, заданного координатами (x2, y2).

// pathExists($map, 0, 0, 4, 4); // True
// pathExists($map, 0, 0, 2, 1); // False




/*
for ($i=0; $i < count($map); $i++) {
    for ($j=0; $j < count($map[$i]); $j++) {

    }
}
*/

$paths = move($x1 = 0, $y1 = 0);
var_dump($paths);

function move($i, $j) {
    
    global $map;
    $a = [];

    if (exists($map, $i+1, $j)) {
        $a[] = move($i+1, $j);
    }
    if (exists($map, $i, $j+1)) {
        $a[] = move($i, $j+1);
    }
    if (exists($map, $i-1, $j)) {
        $a[] = move($i-1, $j); 
    }
    if (exists($map, $i, $j-1)) {
        $a[] = move($i, $j-1);
    }

    return $a ? [$i, $j] : false;
}


function exists($map, $x, $y) {
    return isset($map[$x][$y]) && $map[$x][$y] === '_';
}
